; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       (left ?x - block ?y - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))))
  (:action sort
	     :parameters (?x - block ?y - block)
	     :precondition (and  (holding ?x) (clear ?y) (ontable ?y) )
	     :effect
	     (and (clear ?x)
		  (clear ?y)
		  (left ?x ?y)
		  (ontable ?x))))

; problem
(define (problem BLOCKS-4-0)
(:domain BLOCKS)
(:objects 1 3 4 2 - block)
(:INIT  (CLEAR 1)  (CLEAR 3)  (CLEAR 4)  (CLEAR 2) (ONTABLE 1) (ONTABLE 3) (ONTABLE 4) (ONTABLE 2) (HANDEMPTY))
(:goal (AND (LEFT 1 3) (LEFT 1 4) (LEFT 1 2) (LEFT 3 4) (LEFT 2 3) (LEFT 2 4) (HANDEMPTY) ))
)

; plan
1. (pick-up 1)
   deleted: (ontable 1) (clear 1) (handempty)
   added: (holding 1)
   goals met: 0 of 7
2. (sort 1 3)
   added: (clear 1) (left 1 3) (ontable 1)
   goals met: 1 of 7
3. (sort 1 4)
   added: (left 1 4)
   goals met: 2 of 7
4. (sort 1 2)
   added: (left 1 2)
   goals met: 3 of 7
5. (put-down 1)
   deleted: (holding 1)
   added: (handempty)
   goals met: 4 of 7
6. (pick-up 3)
   deleted: (ontable 3) (clear 3) (handempty)
   added: (holding 3)
   goals met: 3 of 7
7. (sort 3 4)
   added: (clear 3) (left 3 4) (ontable 3)
   goals met: 4 of 7
8. (put-down 3)
   deleted: (holding 3)
   added: (handempty)
   goals met: 5 of 7
9. (pick-up 2)
   deleted: (ontable 2) (clear 2) (handempty)
   added: (holding 2)
   goals met: 4 of 7
10. (sort 2 3)
   added: (clear 2) (left 2 3) (ontable 2)
   goals met: 5 of 7
11. (sort 2 4)
   added: (left 2 4)
   goals met: 6 of 7
12. (put-down 2)
   deleted: (holding 2)
   added: (handempty)
   goals met: 7 of 7
